Herin-iaina/esp32-fastapi/routers/main_p_safe.cpp
#include <WiFi.h>
#include <HTTPClient.h>
#include <ArduinoJson.h>
#include <AccelStepper.h>
#include <LiquidCrystal_I2C.h>
#include <Wire.h>
#include <PCF8574.h>  // Bibliotheque "PCF8574" (Renzo Mischianti) - via Library Manager
#include "DHT.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include <esp_task_wdt.h>
#include "soc/rtc_cntl_reg.h"
#include "soc/soc.h"

// ============================================================
//  ⚠️ DIAGNOSTIC UNIQUEMENT — À RETIRER APRÈS TEST ⚠️
// ============================================================
// Désactive le détecteur de brownout matériel. Ça ne corrige RIEN — ça
// masque juste le symptôme (le reset), pour vérifier si le blocage vient
// bien d'un sous-voltage transitoire. Si avec ça le boot va au bout et que
// tu observes à la place des comportements bizarres (WiFi qui échoue,
// capteurs qui donnent n'importe quoi, redémarrages aléatoires ailleurs),
// ça confirme un vrai problème d'alimentation à régler avant d'aller plus
// loin. Ne JAMAIS garder ça sur un système en usage réel : sans BOD, un
// sous-voltage peut corrompre la flash/l'exécution au lieu de proprement
// redémarrer.
#define DEBUG_DISABLE_BOD 0

// ⚠️ MODE TEST — met à 1 pour tester le stepper (bouton) sans que la lecture
// DHT (init + lectures répétées) n'interfère ou ne pollue les logs. Le WiFi,
// le LCD et les LEDs restent actifs normalement. Remettre à 0 pour l'usage
// réel de l'incubateur.
#define TEST_MODE_SKIP_SENSORS 0

// ============================================================
//  SÉLECTION DU DRIVER STEPPER
// ============================================================
#define STEPPER_DRIVER_TYPE_TB6600  1
#define STEPPER_DRIVER_TYPE_A4988   2
#define STEPPER_DRIVER_TYPE  STEPPER_DRIVER_TYPE_TB6600

// ============================================================
//  DÉFINITION DES PINS
// ============================================================
#define DHT_SENSOR_TYPE     DHT22
#define DHT_1_PIN_DATA      33
// GPIO 34/35/36 sont des broches ENTRÉE SEULE sur l'ESP32 (pas de driver de
// sortie physique) : le protocole DHT a besoin d'envoyer un signal de
// démarrage (ligne tirée au bas) avant de lire la réponse, donc ces
// broches ne peuvent PAS fonctionner avec un DHT, pull-up externe ou pas.
// Rebranche physiquement les capteurs 2/3/4 sur ces broches à la place :
#define DHT_2_PIN_DATA      25
#define DHT_3_PIN_DATA      26
#define DHT_4_PIN_DATA      4

#define STEPPER_PIN_DIR     12
#define STEPPER_PIN_STEP    13
#define STEPPER_ENABLE_PIN  32

// Confirmé par test direct (sketch minimal PUL/DIR/ENA) : ce module TB6600
// a un ENA actif HAUT (HIGH = bobines sous tension, LOW = driver coupé) —
// inverse de la convention ENA+/ENA- standard. Ne pas réinverser sans
// retester physiquement.
#define STEPPER_ENABLE_ACTIVE_STATE   HIGH
#define STEPPER_ENABLE_DISABLE_STATE  LOW

#define FAN_PIN             14
#define HUMIDIFIER_PIN      15

// Le relais est activé par un niveau bas : GPIO LOW signifie relais enclenché.
#define RELAY_ACTIVE_STATE   LOW
#define RELAY_INACTIVE_STATE HIGH

// ============================================================
//  EXPANDER I2C PCF8574 — LEDs + BOUTONS
// ============================================================
// LEDs (3V) et boutons deportes sur un expander PCF8574T pour liberer les
// GPIO ESP32 (16, 17, 18, 19, 23, 27 sont maintenant libres pour un autre
// usage). Bus I2C partage avec le LCD (adresse distincte impérative).
#define I2C_SDA              21
#define I2C_SCL              22
#define PCF8574_ADDRESS      0x20   // Reglable 0x20-0x27 via A0-A2 si conflit

// LEDs montees en actif-BAS (LED + résistance série entre +5V et la pin) :
// pin a 0 = LED allumee (le PCF8574 "sink" le courant), pin a 1 = eteinte.
#define LED_GREEN_PIN       0    // Temp + humidité dans les seuils
#define LED_ORANGE_PIN      1    // Temp ou humidité en dessous du min
#define LED_RED_PIN         2    // Temp ou humidité au dessus du max
#define LED_BLUE_PIN        3    // Serveur inaccessible / mode autonome
#define LED_ACTIVE_STATE    LOW
#define LED_INACTIVE_STATE  HIGH

// Boutons cables entre la pin et GND, pull-up interne faible du PCF8574
#define BUTTON_STEPPER_PIN      4      // (reserve / inutilise, bouton deplace sur GPIO ESP32)
#define BUTTON_LCD_SCROLL_PIN   5

// Bouton moteur reaffecte directement sur un GPIO ESP32 (LEDs PCF8574
// laissees telles quelles, hors service). Pull-down externe 10k vers GND :
// pin LOW au repos, HIGH quand le bouton est appuye (relie au 3.3V).
#define BUTTON_STEPPER_ESP_PIN  27

#define LCD_ADDRESS         0x27
#define LCD_COLS            16
#define LCD_ROWS            2

// ============================================================
//  WIFI & SERVEUR
// ============================================================
const char* ssid       = "Airbox-AB84";
const char* password   = "7ddd6jVJPUR-deEJbxc";
const char* serverIP   = "192.168.1.155";
const int   serverPort = 8000;
const char* apiKey     = "Votre_Cle_API";
const char* HOSTNAME   = "ESP32-Sensor";

// ============================================================
//  SEUILS TEMPÉRATURE / HUMIDITÉ & HYSTÉRÉSIS
// ============================================================
const float TEMP_TARGET       = 37.7f;
const float HUMIDITY_TARGET   = 45.0f;
const float TOLERANCE_PERCENT = 1.5f;

const float TEMP_MIN     = TEMP_TARGET     * (1.0f - TOLERANCE_PERCENT / 100.0f);
const float TEMP_MAX     = TEMP_TARGET     * (1.0f + TOLERANCE_PERCENT / 100.0f);
const float HUMIDITY_MIN = HUMIDITY_TARGET * (1.0f - TOLERANCE_PERCENT / 100.0f);
const float HUMIDITY_MAX = HUMIDITY_TARGET * (1.0f + TOLERANCE_PERCENT / 100.0f);

// Plages d'hystérésis pour la sécurité des relais (mode autonome)
const float TEMP_HYSTERESIS     = 0.3f;
const float HUMIDITY_HYSTERESIS = 0.5f;

// ============================================================
//  TIMING & BUFFERS
// ============================================================
const unsigned long SEND_INTERVAL             = 5000UL;   // ms entre chaque cycle capteurs
const unsigned long LCD_SCROLL_INTERVAL       = 3000UL;   // ms entre chaque défilement auto
const unsigned long RECONNECT_INTERVAL        = 60000UL;  // ms entre tentatives de reconnexion serveur
const unsigned long WIFI_TIMEOUT              = 15000UL;  // ms max pour connexion WiFi
const unsigned long AUTOMATION_POLL_INTERVAL  = 3000UL;   // ms entre chaque poll automation/stepper
const unsigned long HTTP_TIMEOUT              = 1500UL;   // ms timeout par requête HTTP

const int LCD_LOG_BUFFER_SIZE = 6;
const int MAX_SERVER_RETRIES  = 10;

// FIX 1 : WDT à 25s (> WIFI_TIMEOUT de 15s) pour marge de sécurité
const uint32_t WDT_TIMEOUT_SEC = 25;                       

