Herin-iaina/esp32-fastapi/routers/main_p_safe.cpp
// ============================================================
//  CONFIGURATION STEPPER
// ============================================================
#if STEPPER_DRIVER_TYPE == STEPPER_DRIVER_TYPE_TB6600
  #define STEPPER_MAX_SPEED          1000
  #define STEPPER_ACCELERATION       1000
  #define STEPPER_STEPS_PER_ROTATION  800
  #define STEPPER_SPEED               500
  static const char* DRIVER_NAME = "TB6600 (DIR/STEP)";
#else
  #define STEPPER_MAX_SPEED           300
  #define STEPPER_ACCELERATION       1000
  #define STEPPER_STEPS_PER_ROTATION  200
  #define STEPPER_SPEED               100
  static const char* DRIVER_NAME = "A4988 (DIR/STEP)";
#endif

#define STEPPER_ROTATION_STEPS  (STEPPER_STEPS_PER_ROTATION * 5)

// ============================================================
//  OBJETS GLOBAUX
// ============================================================
DHT dht_1(DHT_1_PIN_DATA, DHT_SENSOR_TYPE);
DHT dht_2(DHT_2_PIN_DATA, DHT_SENSOR_TYPE);
DHT dht_3(DHT_3_PIN_DATA, DHT_SENSOR_TYPE);
DHT dht_4(DHT_4_PIN_DATA, DHT_SENSOR_TYPE);

AccelStepper stepper(AccelStepper::DRIVER, STEPPER_PIN_STEP, STEPPER_PIN_DIR);
LiquidCrystal_I2C lcd(LCD_ADDRESS, LCD_COLS, LCD_ROWS);
PCF8574 pcf8574(PCF8574_ADDRESS);

// ============================================================
//  STRUCTURES DE DONNÉES & VARIABLES GLOBALES
// ============================================================
struct SensorData {
  float temperature = 0.0f;
  float humidity    = 0.0f;
  bool  valid       = false;
};

struct SharedState {
  // Écrit par core 1, lu par core 0
  bool     sensorDataReady = false;
  String   pendingPayload;

  // Écrit par core 0, lu par core 1
  bool wifiConnected     = false;
  bool serverConnected   = false;
  bool autonomousMode    = false;
  int  serverFailCount   = 0;

  bool fanCmdFromServer      = false;
  bool humidCmdFromServer    = false;
  bool automationCmdPending  = false;

  bool stepperRequestPending = false;
};

SharedState shared;
SemaphoreHandle_t stateMutex;
SemaphoreHandle_t lcdLogMutex;
TaskHandle_t networkTaskHandle;

bool  fanOn           = false;
bool  humidifierOn    = false;
bool  autonomousMode  = false;   // Copie locale Core 1
bool  serverConnected = false;   // Copie locale Core 1
bool  wifiConnected   = false;   // Copie locale Core 1

float avgTemperature  = 0.0f;
float avgHumidity     = 0.0f;
int   numFailedSensors = 0;
bool  stepperEnabled   = false;

// Anti-rebond non-bloquant
unsigned long lastButtonPress       = 0;
unsigned long lastScrollButtonPress = 0;
bool stepperBtnPendingCheck         = false;
bool lcdBtnPendingCheck             = false;
unsigned long stepperBtnTriggerTime = 0;
unsigned long lcdBtnTriggerTime     = 0;

// FIX SECURITE : etat de presence reelle du PCF8574 sur le bus I2C.
// Tant que ce flag est false, on IGNORE toute lecture de bouton et
// tout pilotage LED via le PCF8574 : un module debranche ne doit
// jamais pouvoir simuler un appui bouton et lancer le moteur.
bool pcf8574Connected             = false;
unsigned long lastPcf8574CheckTime = 0;
const unsigned long PCF8574_CHECK_INTERVAL = 1000; // ms — sonde la presence reguliement

// Sonde legere et fiable : ACK I2C direct sur l'adresse du PCF8574.
// Independant de la logique interne de la bibliotheque, donc marche
// meme si le module a ete debranche apres le demarrage.
bool probePCF8574Presence() {
  Wire.beginTransmission(PCF8574_ADDRESS);
  return (Wire.endTransmission() == 0);
}

// LCD log ring buffer
char lcdLogBuffer[LCD_LOG_BUFFER_SIZE][LCD_COLS + 1];
int  lcdLogCount = 0;
int  lcdLogIndex = 0;
int  lcdLogStart = 0;
unsigned long lastLogScroll = 0;

// Mémorise le dernier index de cycle serveur ayant déclenché une rotation
// stepper (Core 0 uniquement — networkTaskFunction/getStepperCommand). Voir
// getStepperCommand() : sert à éviter de redéclencher une rotation à
// chaque poll (~3s) tant que le serveur renvoie stepper=true pour la même
// fenêtre de 2 minutes.
long lastStepperCycleTriggered = -1;

// ============================================================
//  GESTION STEPPER / POWER (Core 1)
// ============================================================

void enableStepper() {
  if (!stepperEnabled) {
    digitalWrite(STEPPER_ENABLE_PIN, STEPPER_ENABLE_ACTIVE_STATE);
    delay(20); // Stabilisation du courant avant le premier pas (aligné sur le test validé)
    stepperEnabled = true;
  }
}

void disableStepper() {
  if (stepperEnabled) {
    digitalWrite(STEPPER_ENABLE_PIN, STEPPER_ENABLE_DISABLE_STATE);
    stepperEnabled = false;
  }
}

void startStepperRotation(const char* origin) {
  if (stepper.distanceToGo() != 0) {
    Serial.printf("Rotation ignoree (%s) — moteur deja en mouvement\n", origin);
    return;
  }
  Serial.printf("Rotation stepper activee (%s)\n", origin);
  stepper.setMaxSpeed(STEPPER_SPEED);
  enableStepper();
  stepper.move(STEPPER_ROTATION_STEPS);
}

// ============================================================
//  UTILITAIRES LCD LOG & DISPLAY (Core 1)
// ============================================================

void printLCDLine(int row, const char* line) {
  lcd.setCursor(0, row);
  lcd.print(line);
  for (int i = strlen(line); i < LCD_COLS; i++) {
    lcd.print(' ');
  }
}

void pushLCDLog(const char* msg) {
  char text[LCD_COLS + 1];
  snprintf(text, sizeof(text), "%s", msg);

  xSemaphoreTake(lcdLogMutex, portMAX_DELAY);

  int lastIndex = (lcdLogStart + lcdLogCount - 1 + LCD_LOG_BUFFER_SIZE) % LCD_LOG_BUFFER_SIZE;
  if (lcdLogCount > 0 && strcmp(text, lcdLogBuffer[lastIndex]) == 0) {
    xSemaphoreGive(lcdLogMutex);
    return;
  }

  if (lcdLogCount < LCD_LOG_BUFFER_SIZE) {
    int idx = (lcdLogStart + lcdLogCount) % LCD_LOG_BUFFER_SIZE;
    strcpy(lcdLogBuffer[idx], text);
    lcdLogCount++;
  } else {
    lcdLogStart = (lcdLogStart + 1) % LCD_LOG_BUFFER_SIZE;
    int idx = (lcdLogStart + lcdLogCount - 1) % LCD_LOG_BUFFER_SIZE;
    strcpy(lcdLogBuffer[idx], text);
  }

  xSemaphoreGive(lcdLogMutex);
}

void getCurrentLCDLog(char* out, size_t outSize) {
  xSemaphoreTake(lcdLogMutex, portMAX_DELAY);
  if (lcdLogCount == 0) {
    out[0] = '\0';
  } else {
    if (lcdLogIndex >= lcdLogCount) {
      lcdLogIndex = 0;
    }
    int idx = (lcdLogStart + lcdLogIndex) % LCD_LOG_BUFFER_SIZE;
    snprintf(out, outSize, "%s", lcdLogBuffer[idx]);
  }
  xSemaphoreGive(lcdLogMutex);
}

void advanceLCDLog() {
  xSemaphoreTake(lcdLogMutex, portMAX_DELAY);
  if (lcdLogCount > 1) {
    lcdLogIndex = (lcdLogIndex + 1) % lcdLogCount;
  }
  xSemaphoreGive(lcdLogMutex);
}

void updateLCDScroll(unsigned long now) {
  if (now - lastLogScroll >= LCD_SCROLL_INTERVAL) {
    lastLogScroll = now;
    advanceLCDLog();
  }
}

