Herin-iaina/esp32-fastapi/routers/main_p_safe.cpp
void displayStatusOnLCD(float avgTemp, float avgHumid) {
  char line0[LCD_COLS + 1];
  bool stepperMoving = stepper.distanceToGo() != 0;
  const char* wifiState = wifiConnected ? "OK" : "--";

  if (autonomousMode) {
    snprintf(line0, sizeof(line0), "AUTO W:%s S:%s", wifiState, stepperMoving ? "ON" : "OFF");
  } else {
    snprintf(line0, sizeof(line0), "T:%.0f H:%d W:%s", avgTemp, (int)avgHumid, wifiState);
  }
  printLCDLine(0, line0);

  char line1[LCD_COLS + 1];
  getCurrentLCDLog(line1, sizeof(line1));
  printLCDLine(1, line1);
}

// ============================================================
//  WIFI & SERVEUR (Core 0 - NetworkTask)
// ============================================================

void buildServerUrl(const char* endpoint, char* output, size_t size) {
  // Le backend FastAPI est exposé avec le préfixe /api
  snprintf(output, size, "http://%s:%d/api%s", serverIP, serverPort, endpoint);
}

void connectWiFi() {
  if (WiFi.status() == WL_CONNECTED) {
    return;
  }

  WiFi.mode(WIFI_STA);
  // Réduit la puissance d'émission WiFi pour limiter les pics de courant
  // (jusqu'à ~400-500mA en pleine puissance) qui peuvent faire chuter le
  // rail 3.3V sous le seuil du détecteur de brownout sur une alimentation
  // USB faible/longue. Ce n'est qu'une mitigation logicielle : le vrai fix
  // reste une alimentation capable de fournir les pics de courant (voir
  // note plus bas) + un condensateur de découplage proche de l'ESP32.
  WiFi.setTxPower(WIFI_POWER_8_5dBm);
  WiFi.setHostname(HOSTNAME);
  Serial.println(F("Connexion WiFi..."));
  WiFi.begin(ssid, password);

  unsigned long start = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - start < WIFI_TIMEOUT) {
    vTaskDelay(pdMS_TO_TICKS(500)); 
    // FIX 2 : Feed du WDT dans la boucle d'attente WiFi pour éviter le reset intempestif
    esp_task_wdt_reset(); 
    Serial.print(".");
  }

  bool isConnected = (WiFi.status() == WL_CONNECTED);
  xSemaphoreTake(stateMutex, portMAX_DELAY);
  shared.wifiConnected = isConnected;
  xSemaphoreGive(stateMutex);

  if (isConnected) {
    Serial.println("\nConnecte — IP: " + WiFi.localIP().toString());
    pushLCDLog("WiFi connecte");
  } else {
    Serial.printf("\nEchec WiFi (statut=%d)\n", WiFi.status());
    pushLCDLog("WiFi echec");
  }
}

void checkAutonomousMode_locked() {
  if (!shared.autonomousMode && shared.serverFailCount >= MAX_SERVER_RETRIES) {
    shared.autonomousMode = true;
    Serial.println(F("\n*** MODE AUTONOME ACTIVE ***"));
    Serial.printf("  %d echecs consecutifs\n", MAX_SERVER_RETRIES);
    pushLCDLog("Mode autonome");
  }
}

bool sendDataToServer(const String& jsonPayload) {
  if (WiFi.status() != WL_CONNECTED) {
    xSemaphoreTake(stateMutex, portMAX_DELAY);
    shared.wifiConnected = false;
    shared.serverFailCount++;
    checkAutonomousMode_locked();
    xSemaphoreGive(stateMutex);
    return false;
  }

  WiFiClient wifiClient;
  HTTPClient http;
  char url[128];
  buildServerUrl("/sensor/values", url, sizeof(url));
  http.setTimeout(HTTP_TIMEOUT);
  http.begin(wifiClient, url);
  http.addHeader("Content-Type", "application/json");
  http.addHeader("x-api-key", apiKey);

  int code = http.POST(jsonPayload);

  xSemaphoreTake(stateMutex, portMAX_DELAY);
  bool success = false;
  if (code > 0) {
    Serial.printf("POST /sensor/values -> %d\n", code);
    if (code == HTTP_CODE_OK || code == HTTP_CODE_CREATED) {
      pushLCDLog("Serveur OK");
      shared.serverFailCount = 0;
      shared.serverConnected = true;
      shared.autonomousMode = false;
      success = true;
    } else {
      char msg[LCD_COLS + 1];
      snprintf(msg, sizeof(msg), "Serveur err %d", code);
      pushLCDLog(msg);
      shared.serverFailCount++;
      shared.serverConnected = false;
      checkAutonomousMode_locked();
    }
  } else {
    Serial.printf("POST echec: %s\n", http.errorToString(code).c_str());
    pushLCDLog("POST echec");
    shared.serverFailCount++;
    shared.serverConnected = false;
    checkAutonomousMode_locked();
  }
  xSemaphoreGive(stateMutex);

  http.end();
  return success;
}

void tryReconnectToServer() {
  if (WiFi.status() != WL_CONNECTED) {
    connectWiFi();
    return;
  }

  Serial.println(F("Tentative de reconnexion au serveur..."));
  WiFiClient wifiClient;
  HTTPClient http;
  char url[128];
  buildServerUrl("/sensor/automation/status", url, sizeof(url));
  http.setTimeout(HTTP_TIMEOUT);
  http.begin(wifiClient, url);
  http.addHeader("x-api-key", apiKey);
  int code = http.GET();
  http.end();

  if (code == HTTP_CODE_OK) {
    Serial.println(F("Serveur accessible — sortie du mode autonome"));
    xSemaphoreTake(stateMutex, portMAX_DELAY);
    shared.autonomousMode  = false;
    shared.serverFailCount = 0;
    shared.serverConnected = true;
    xSemaphoreGive(stateMutex);
    pushLCDLog("Serveur retrouve");
    pushLCDLog("Mode normal");
  } else {
    Serial.printf("Reconnect serveur echec -> %d\n", code);
    xSemaphoreTake(stateMutex, portMAX_DELAY);
    shared.serverConnected = false;
    xSemaphoreGive(stateMutex);
    pushLCDLog("Server NOK");
  }
}

bool getAutomationStatus() {
  if (WiFi.status() != WL_CONNECTED) return false;

  WiFiClient wifiClient;
  HTTPClient http;
  char url[128];
  buildServerUrl("/sensor/automation/status", url, sizeof(url));
  http.setTimeout(HTTP_TIMEOUT);
  http.begin(wifiClient, url);
  http.addHeader("x-api-key", apiKey);
  int code = http.GET();

  if (code == HTTP_CODE_OK) {
    String response = http.getString();
    JsonDocument doc;
    DeserializationError error = deserializeJson(doc, response);
    if (!error) {
      bool fanCmd   = doc["fan"]        | false;
      bool humidCmd = doc["humidifier"] | false;

      xSemaphoreTake(stateMutex, portMAX_DELAY);
      shared.fanCmdFromServer     = fanCmd;
      shared.humidCmdFromServer   = humidCmd;
      shared.automationCmdPending = true;
      xSemaphoreGive(stateMutex);

      pushLCDLog("Server OK");
      pushLCDLog("Cmd automation");
      http.end();
      return true;
    }
    pushLCDLog("JSON statut err");
  } else {
    pushLCDLog("Server NOK");
  }

  http.end();
  return false;
}

bool getStepperCommand() {
  if (WiFi.status() != WL_CONNECTED) return false;

  WiFiClient wifiClient;
  HTTPClient http;
  char url[128];
  buildServerUrl("/sensor/automation/stepper", url, sizeof(url));
  http.setTimeout(HTTP_TIMEOUT);
  http.begin(wifiClient, url);
  http.addHeader("x-api-key", apiKey);
  int code = http.GET();

