Herin-iaina/esp32-fastapi/routers/main_p_safe.cpp
  if (code == HTTP_CODE_OK) {
    String response = http.getString();
    JsonDocument doc;
    DeserializationError error = deserializeJson(doc, response);
    if (!error) {
      bool stepperCmd    = doc["stepper"] | false;
      bool hasCycleField = doc["cycle"].is<long>();
      long cycleIndex    = hasCycleField ? doc["cycle"].as<long>() : -2;

      // Le serveur renvoie stepper=true pendant toute une fenêtre de 2
      // minutes (voir get_automation_stepper côté backend). Une rotation
      // ne prenant que quelques secondes, sans ce garde-fou l'ESP32
      // redéclencherait une nouvelle rotation à CHAQUE poll (~3s) tant que
      // la fenêtre reste active — soit une dizaine de rotations au lieu
      // d'une seule. "cycle" identifie la fenêtre : on ne déclenche que si
      // elle diffère de la dernière déjà exécutée.
      // Repli : si le backend n'envoie pas encore "cycle" (ancienne
      // version non mise à jour), on retombe sur l'ancien comportement
      // (déclenche à chaque poll) plutôt que de bloquer silencieusement
      // le stepper.
      bool shouldTrigger = stepperCmd && (!hasCycleField || cycleIndex != lastStepperCycleTriggered);

      if (shouldTrigger) {
        xSemaphoreTake(stateMutex, portMAX_DELAY);
        shared.stepperRequestPending = true;
        xSemaphoreGive(stateMutex);
        if (hasCycleField) {
          lastStepperCycleTriggered = cycleIndex;
        }
        pushLCDLog("Stepper ON (srv)");
      }
      http.end();
      return true;
    }
    pushLCDLog("JSON stepper err");
  } else {
    pushLCDLog("Server NOK");
  }

  http.end();
  return false;
}

// ============================================================
//  TÂCHE RÉSEAU (Core 0)
// ============================================================
void networkTaskFunction(void* pvParameters) {
  esp_task_wdt_add(NULL);

  unsigned long lastAutomationPoll   = 0;
  unsigned long lastReconnectAttempt = 0;

  connectWiFi();

  for (;;) {
    esp_task_wdt_reset();
    unsigned long now = millis();

    bool isConnected = (WiFi.status() == WL_CONNECTED);
    xSemaphoreTake(stateMutex, portMAX_DELAY);
    shared.wifiConnected = isConnected;
    bool localAutonomous = shared.autonomousMode;
    xSemaphoreGive(stateMutex);

    if (!isConnected) {
      connectWiFi();
    }

    if (localAutonomous) {
      if (now - lastReconnectAttempt >= RECONNECT_INTERVAL) {
        lastReconnectAttempt = now;
        tryReconnectToServer();
      }
    } else {
      bool   hasData = false;
      String payloadCopy;

      xSemaphoreTake(stateMutex, portMAX_DELAY);
      if (shared.sensorDataReady) {
        payloadCopy = shared.pendingPayload;
        shared.sensorDataReady = false;
        hasData = true;
      }
      xSemaphoreGive(stateMutex);

      if (hasData) {
        sendDataToServer(payloadCopy);
      }

      if (now - lastAutomationPoll >= AUTOMATION_POLL_INTERVAL) {
        lastAutomationPoll = now;
        getAutomationStatus();
        getStepperCommand();
      }
    }

    vTaskDelay(pdMS_TO_TICKS(50));
  }
}

// ============================================================
//  LOGIQUE DE SECOURS AVEC HYSTÉRÉSIS (Core 1)
// ============================================================

void applyBackupLogic(float avgTemp, float avgHumid) {
  if (avgTemp > 0.0f) {
    if (avgTemp < (TEMP_MIN - TEMP_HYSTERESIS)) {
      fanOn = true;
    } else if (avgTemp > TEMP_TARGET) {
      fanOn = false;
    }
    digitalWrite(FAN_PIN, fanOn ? RELAY_ACTIVE_STATE : RELAY_INACTIVE_STATE);
  }

  if (avgHumid > 0.0f) {
    if (avgHumid < (HUMIDITY_MIN - HUMIDITY_HYSTERESIS)) {
      humidifierOn = true;
    } else if (avgHumid > HUMIDITY_TARGET) {
      humidifierOn = false;
    }
    digitalWrite(HUMIDIFIER_PIN, humidifierOn ? RELAY_ACTIVE_STATE : RELAY_INACTIVE_STATE);
  }
}

SensorData readSensor(DHT& dht, int num) {
  SensorData data;
  data.humidity    = dht.readHumidity();
  data.temperature = dht.readTemperature();
  data.valid       = !isnan(data.humidity) && !isnan(data.temperature);
  if (!data.valid) {
    Serial.printf("Capteur %d: ERREUR\n", num);
    data.temperature = 0.0f;
    data.humidity    = 0.0f;
  }
  return data;
}

void calculateAverages(SensorData sensors[], int count, float& avgTemp, float& avgHumid, int& failedCount) {
  float tTotal = 0.0f, hTotal = 0.0f;
  int valid = 0;
  failedCount = 0;

  for (int i = 0; i < count; i++) {
    if (sensors[i].valid) {
      tTotal += sensors[i].temperature;
      hTotal += sensors[i].humidity;
      valid++;
    } else {
      failedCount++;
    }
  }

  avgTemp  = valid > 0 ? tTotal / valid : 0.0f;
  avgHumid = valid > 0 ? hTotal / valid : 0.0f;
}

void initLEDs() {
  const uint8_t pins[] = { LED_GREEN_PIN, LED_ORANGE_PIN, LED_RED_PIN, LED_BLUE_PIN };
  for (uint8_t p : pins) {
    pcf8574.pinMode(p, OUTPUT);
    pcf8574.digitalWrite(p, LED_INACTIVE_STATE);
  }
}

void setAllLEDsOff() {
  if (!pcf8574Connected) return;
  pcf8574.digitalWrite(LED_GREEN_PIN,  LED_INACTIVE_STATE);
  pcf8574.digitalWrite(LED_ORANGE_PIN, LED_INACTIVE_STATE);
  pcf8574.digitalWrite(LED_RED_PIN,    LED_INACTIVE_STATE);
  pcf8574.digitalWrite(LED_BLUE_PIN,   LED_INACTIVE_STATE);
}

void updateStatusLEDs(float avgTemp, float avgHumid, bool serverOk) {
  // SECURITE : pas de PCF8574 => pas de tentative d'ecriture I2C inutile
  // (evite de bloquer sur des transactions qui vont echouer a chaque tour).
  if (!pcf8574Connected) return;

  setAllLEDsOff();

  if (!serverOk || autonomousMode) {
    pcf8574.digitalWrite(LED_BLUE_PIN, LED_ACTIVE_STATE);
  }
  if (avgTemp <= 0.0f || avgHumid <= 0.0f) {
    pcf8574.digitalWrite(LED_RED_PIN, LED_ACTIVE_STATE);
    return;
  }

  bool tempOk  = avgTemp  >= TEMP_MIN     && avgTemp  <= TEMP_MAX;
  bool humidOk = avgHumid >= HUMIDITY_MIN && avgHumid <= HUMIDITY_MAX;

  if (tempOk && humidOk) {
    pcf8574.digitalWrite(LED_GREEN_PIN, LED_ACTIVE_STATE);
  } else if (avgTemp > TEMP_MAX || avgHumid > HUMIDITY_MAX) {
    pcf8574.digitalWrite(LED_RED_PIN, LED_ACTIVE_STATE);
  } else {
    pcf8574.digitalWrite(LED_ORANGE_PIN, LED_ACTIVE_STATE);
  }
}

// FIX 3 : Debounce 100% NON-BLOQUANT pour éliminer les micro-saccades moteur
void checkStepperButton() {
  // Bouton moteur sur GPIO ESP32 direct (pull-down externe) — independant
  // du PCF8574, donc pas de garde pcf8574Connected ici : ce bouton doit
  // continuer a fonctionner meme si le PCF8574/LEDs restent hors service.
  const unsigned long DEBOUNCE = 200;
  const unsigned long CONFIRM_TIME = 20;
  unsigned long now = millis();

  if (!stepperBtnPendingCheck) {
    if (digitalRead(BUTTON_STEPPER_ESP_PIN) == HIGH && (now - lastButtonPress > DEBOUNCE)) {
      stepperBtnPendingCheck = true;
      stepperBtnTriggerTime = now;
    }
  } else {
    if (now - stepperBtnTriggerTime >= CONFIRM_TIME) {
      stepperBtnPendingCheck = false;
      if (digitalRead(BUTTON_STEPPER_ESP_PIN) == HIGH) {
        lastButtonPress = now;
        pushLCDLog("Stepper manuel");
        startStepperRotation("bouton");
      }
    }
  }
}

void checkLCDScrollButton() {
  // Meme securite que checkStepperButton() : pas de PCF8574, pas de lecture.
  if (!pcf8574Connected) return;

