Herin-iaina/esp32-fastapi/routers/main_p_safe.cpp
  const unsigned long DEBOUNCE = 200;
  const unsigned long CONFIRM_TIME = 20;
  unsigned long now = millis();

  if (!lcdBtnPendingCheck) {
    if (pcf8574.digitalRead(BUTTON_LCD_SCROLL_PIN) == LOW && (now - lastScrollButtonPress > DEBOUNCE)) {
      lcdBtnPendingCheck = true;
      lcdBtnTriggerTime = now;
    }
  } else {
    if (now - lcdBtnTriggerTime >= CONFIRM_TIME) {
      lcdBtnPendingCheck = false;
      if (pcf8574.digitalRead(BUTTON_LCD_SCROLL_PIN) == LOW) {
        lastScrollButtonPress = now;
        advanceLCDLog();
      }
    }
  }
}

void applyNetworkOutputs() {
  bool localAutonomous, localServerConnected, localWifiConnected;
  bool automationPending, fanCmd = false, humidCmd = false;
  bool stepperPending;

  xSemaphoreTake(stateMutex, portMAX_DELAY);
  localAutonomous      = shared.autonomousMode;
  localServerConnected = shared.serverConnected;
  localWifiConnected   = shared.wifiConnected;
  automationPending    = shared.automationCmdPending;
  if (automationPending) {
    fanCmd   = shared.fanCmdFromServer;
    humidCmd = shared.humidCmdFromServer;
    shared.automationCmdPending = false;
  }
  stepperPending = shared.stepperRequestPending;
  if (stepperPending) {
    shared.stepperRequestPending = false;
  }
  xSemaphoreGive(stateMutex);

  autonomousMode  = localAutonomous;
  serverConnected = localServerConnected;
  wifiConnected   = localWifiConnected;

  if (!autonomousMode && automationPending) {
    digitalWrite(FAN_PIN,        fanCmd   ? RELAY_ACTIVE_STATE : RELAY_INACTIVE_STATE);
    digitalWrite(HUMIDIFIER_PIN, humidCmd ? RELAY_ACTIVE_STATE : RELAY_INACTIVE_STATE);
    fanOn        = fanCmd;
    humidifierOn = humidCmd;
  }

  if (stepperPending) {
    startStepperRotation("serveur");
  }
}

void printStatus(SensorData sensors[], int count, float avgTemp, float avgHumid, int failed) {
  Serial.println(F("\n========== STATUS =========="));
  for (int i = 0; i < count; i++) {
    Serial.printf("  Capteur %d: %.1f°C, %.1f%% %s\n",
                  i + 1, sensors[i].temperature, sensors[i].humidity,
                  sensors[i].valid ? "" : "[ERREUR]");
  }
  Serial.printf("  Moyenne   : %.2f°C, %.2f%%\n", avgTemp, avgHumid);
  Serial.printf("  Fan: %s  |  Humidif: %s  |  Defauts: %d\n",
                fanOn ? "ON" : "OFF", humidifierOn ? "ON" : "OFF", failed);
  Serial.printf("  Stepper: %s (%ld)\n",
                stepper.distanceToGo() != 0 ? "MOVING" : "IDLE", stepper.distanceToGo());
  Serial.printf("  Server: %s  WiFi: %s\n",
                serverConnected ? "OK" : "NOK", wifiConnected ? "OK" : "NOK");
  if (autonomousMode) {
    Serial.println(F("  >>> MODE AUTONOME ACTIF <<<"));
  }
  Serial.println(F("============================\n"));
}

void setup() {
#if DEBUG_DISABLE_BOD
  WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0); // ⚠️ diagnostic seulement, voir note plus haut
#endif

  Serial.begin(115200);
  delay(1000);

  Serial.println(F("\n=== ESP32 Incubator Controller v4.2 ==="));

  // Les mutex doivent être créés en tout premier : pushLCDLog() (appelée dès
  // le premier lcd.init()/printLCDLine ci-dessous) prend lcdLogMutex, et
  // sendDataToServer()/checkAutonomousMode_locked() prennent stateMutex. Tant
  // que ces handles valent NULL (valeur par défaut avant création), tout
  // xSemaphoreTake() dessus déclenche l'assertion FreeRTOS
  // "xQueueSemaphoreTake ... (( pxQueue ))" et fait rebooter la carte.
  stateMutex  = xSemaphoreCreateMutex();
  lcdLogMutex = xSemaphoreCreateMutex();

  // FIX 4 : Rétrocompatibilité multi-versions ESP32 Arduino Core (v2.x vs v3.x)
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  esp_task_wdt_config_t twdt_config = {
      .timeout_ms = WDT_TIMEOUT_SEC * 1000,
      .idle_core_mask = (1 << 0) | (1 << 1),
      .trigger_panic = true
  };
  esp_task_wdt_reconfigure(&twdt_config);
  esp_task_wdt_add(NULL);
#else
  esp_task_wdt_init(WDT_TIMEOUT_SEC, true);
  esp_task_wdt_add(NULL);
#endif

  pinMode(STEPPER_ENABLE_PIN, OUTPUT);
  disableStepper();

  // Bus I2C partage : LCD + PCF8574 (LEDs/boutons). A initialiser avant tout
  // accès à l'un ou l'autre.
  Wire.begin(I2C_SDA, I2C_SCL);
  if (!pcf8574.begin()) {
    Serial.println(F("ATTENTION: PCF8574 (LEDs/boutons) non detecte!"));
  }
  pcf8574Connected = probePCF8574Presence();
  if (!pcf8574Connected) {
    Serial.println(F("ATTENTION: PCF8574 absent du bus I2C — boutons/LEDs desactives par securite."));
  }

  lcd.init();
  lcd.backlight();
  printLCDLine(0, "ESP32 Sensor v4");
  printLCDLine(1, "Init...");
  pushLCDLog("Initializing...");

#if !TEST_MODE_SKIP_SENSORS
  dht_1.begin();
  dht_2.begin();
  dht_3.begin();
  dht_4.begin();
#endif

  stepper.setMaxSpeed(STEPPER_MAX_SPEED);
  stepper.setAcceleration(STEPPER_ACCELERATION);

  pinMode(FAN_PIN,        OUTPUT);
  digitalWrite(FAN_PIN,        RELAY_INACTIVE_STATE);
  pinMode(HUMIDIFIER_PIN, OUTPUT);
  pinMode(BUTTON_STEPPER_ESP_PIN, INPUT); // pull-down externe : LOW au repos
  digitalWrite(HUMIDIFIER_PIN, RELAY_INACTIVE_STATE);

  if (pcf8574Connected) {
    initLEDs();
    pcf8574.digitalWrite(LED_BLUE_PIN, LED_ACTIVE_STATE);

    // Bouton LCD scroll seul reste sur le PCF8574 (mode INPUT = pull-up
    // faible interne, quasi-bidirectionnel). Le bouton moteur est
    // maintenant sur GPIO ESP32 direct, voir BUTTON_STEPPER_ESP_PIN.
    pcf8574.pinMode(BUTTON_LCD_SCROLL_PIN, INPUT);
  }

  xTaskCreatePinnedToCore(
    networkTaskFunction,
    "NetworkTask",
    8192,
    NULL,
    1,
    &networkTaskHandle,
    0
  );

  Serial.println(F("Initialisation terminee. NetworkTask sur Core 0.\n"));
}

void loop() {
  esp_task_wdt_reset(); 

  static unsigned long lastSendTime     = 0;
  static unsigned long lastSlowTaskTime = 0;
  unsigned long now = millis();

  applyNetworkOutputs();

  // Pilotage non-bloquant du Stepper
  if (stepper.distanceToGo() != 0) {
    enableStepper();
    stepper.run();
  } else {
    disableStepper();
  }

  // Lecture et traitement des capteurs
  if (now - lastSendTime >= SEND_INTERVAL) {
    lastSendTime = now;

#if TEST_MODE_SKIP_SENSORS
    // Pas de lecture DHT — juste un heartbeat pour confirmer que loop()
    // tourne normalement pendant le test du stepper.
    Serial.println(F("[TEST_MODE_SKIP_SENSORS] capteurs desactives — test stepper en cours"));
#else
    SensorData sensors[4];
    sensors[0] = readSensor(dht_1, 1);
    sensors[1] = readSensor(dht_2, 2);
    sensors[2] = readSensor(dht_3, 3);
    sensors[3] = readSensor(dht_4, 4);

    calculateAverages(sensors, 4, avgTemperature, avgHumidity, numFailedSensors);

    JsonDocument payload;
    for (int i = 0; i < 4; i++) {
      char key[10];
      snprintf(key, sizeof(key), "sensor_%d", i + 1);
      payload[key]["temperature"] = sensors[i].temperature;
      payload[key]["humidity"]    = sensors[i].humidity;
      payload[key]["valid"]       = sensors[i].valid;
    }
    payload["average_temperature"] = avgTemperature;
    payload["average_humidity"]    = avgHumidity;
    payload["fan_status"]          = fanOn;
    payload["humidifier_status"]   = humidifierOn;
    payload["numFailedSensors"]    = numFailedSensors;

    String jsonPayload;
    serializeJson(payload, jsonPayload);

    if (!autonomousMode) {
      xSemaphoreTake(stateMutex, portMAX_DELAY);
      shared.pendingPayload   = jsonPayload;
      shared.sensorDataReady  = true;
      xSemaphoreGive(stateMutex);
    }

    if (autonomousMode || !serverConnected) {
      applyBackupLogic(avgTemperature, avgHumidity);
    }

    printStatus(sensors, 4, avgTemperature, avgHumidity, numFailedSensors);
#endif
  }

  // SECURITE : re-sonde la presence du PCF8574 regulierement. Si le
  // module est debranche en cours de route, pcf8574Connected repasse a
  // false et coupe immediatement la lecture des boutons/LEDs — un fil
  // arrache ne doit jamais pouvoir faire tourner le moteur tout seul.
  if (now - lastPcf8574CheckTime >= PCF8574_CHECK_INTERVAL) {
    lastPcf8574CheckTime = now;
    bool wasConnected = pcf8574Connected;
    pcf8574Connected = probePCF8574Presence();
    if (wasConnected && !pcf8574Connected) {
      Serial.println(F("ATTENTION: PCF8574 deconnecte du bus I2C — LEDs/bouton LCD desactives."));
    } else if (!wasConnected && pcf8574Connected) {
      Serial.println(F("PCF8574 reconnecte — reinitialisation LEDs/bouton LCD."));
      initLEDs();
      pcf8574.pinMode(BUTTON_LCD_SCROLL_PIN, INPUT);
    }
  }

  // Tâches secondaires d'affichage et boutons
  if (now - lastSlowTaskTime >= 50) {
    lastSlowTaskTime = now;
    checkStepperButton();
    checkLCDScrollButton();
    updateLCDScroll(now);
    updateStatusLEDs(avgTemperature, avgHumidity, serverConnected);
    displayStatusOnLCD(avgTemperature, avgHumidity);
  }

  delay(1);
}